var Conf = {
    authorUrl: 'https://open.weixin.qq.com/connect/oauth2/authorize',
    // authorUrl: 'http://test.airobotq.com/getweixincode.html',

    // domainRoot : 'https://wx.airobotq.com/', //www根目录
    domainRoot : 'https://test.airobotq.com/', //测试 www根目录
    // domainRoot : 'https://h5.airobotq.com/', //测试 www根目录

    // domainApi : 'https://api.airobotq.com/tomorrow/', //生产API根目录
    domainApi : 'https://apit.airobotq.com/tomorrow/', //测试API根目录
    // domainApi : 'https://h5.airobotq.com/tomorrow/', //测试API根目录
    // domainApi : 'http://192.168.43.29:8080/tomorrow/', //Oliver
    // domainApi : 'http://192.168.41.197:8080/tomorrow/', // Jason

    // appId:'wx651b563eae791da7', //生产公众号
    appId:'wxfaf7d2bb7f1ae267', //测试公众号

    // imgUrl: 'http://wx.airobotq.com/', // 生产图片服务器
    imgUrl: 'https://test.airobotq.com/', // 测试图片服务器
    // imgUrl: 'https://h5.airobotq.com/', // 测试图片服务器
    // imgUrl: 'http://ormm6wbtx.bkt.clouddn.com/', // cdn测试图片服务器

    enterUrl: 'userInfoInput.html',
    // enterUrl: 'router.html',  // 临时A/B testing入口(已废弃)
    enter: 'userInfoInput',

    constellation:['白羊','金牛','双子','巨蟹','狮子','处女','天秤','天蝎','射手','摩羯','水瓶','双鱼'],
    wuxing:['水','火','木','金','土'],
    guaxiang:['坤','剥','比','观','豫','晋','萃','否','谦','艮','蹇','渐','小过','旅','咸','遁','师','蒙','坎','涣','解','未济','困','讼','升','蛊','井','巽','恒','鼎','大过','姤','复','颐','屯','益','震','噬嗑','随','无妄','明夷','贲','既济','家人','丰','离','革','同人','临','损','节','中孚','归妹','睽','兑','履','泰','大畜','需','小畜','大壮','大有','夬','乾'],
    constellationPanelIdxArr:[9,8,7,6,5,4,3,2,1,12,11,10],
    guaxiangPanelIdxArr:[64,32,31,30,29,28,27,26,25,24,23,22,21,20,19,18,17,16,15,14,13,12,11,10,9,8,7,6,5,4,3,2,1,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63],
    wuxingPanelIdxArr : [1,2,3,4,5],
    personalityPanelIdxArr : [1,4,3,2],
    personalityCate:['守护','艺术','浪漫','理智'],
    personality:[
                        ['大主管','管理者','组织者','保护者','推进者','实干家','摄政官','艺术家','导师','理想者','哲学家','关怀者','统帅者','思想者','创新者','分析师'],
                        ['女强人','监督者','奉献者','守护者','促进者','巧思者','外交家','艺术家','教导主任','梦想家','启发者','治愈者','领导者','睿智者','预言家','学者']
                    ],
    personalityType:['ESTJ','ISTJ','ESFJ','ISFJ','ESTP','ISTP','ESFP','ISFP','ENFJ','INFJ','ENFP','INFP','ENTJ','INTJ','ENTP','INTP'],
    personalityTypeDivisorMap:{
                        'E':  '外向',
                        'I':  '内向',
                        'S':  '感觉',
                        'N':  '直觉',
                        'T':  '逻辑',
                        'F':  '情感',
                        'J':  '计划',
                        'P':  '探索'
                    },
    personalityMap:{
        'e':  '开放',
        'i':  '内敛',
        's':  '随和',
        'n':  '自我',
        't':  '理性',
        'f':  '感性',
        'j':  '规划',
        'p':  '变通'
    },
    personalityTypeMap:{
                    'ESTJ': {
                        tid:1, cid : 1, id : 1
                    },
                    'ISTJ': {
                        tid:2, cid : 1, id : 2
                    },
                    'ESFJ': {
                        tid:3, cid : 1, id : 3
                    },
                    'ISFJ': {
                        tid:4, cid : 1, id : 4
                    },
                    'ESTP': {
                        tid:5, cid : 2, id : 5
                    },
                    'ISTP': {
                        tid:6, cid : 2, id : 6
                    },
                    'ESFP': {
                        tid:7, cid : 2, id : 7
                    },
                    'ISFP': {
                        tid:8, cid : 2, id : 8
                    },
                    'ENFJ': {
                        tid:9, cid : 3, id : 9
                    },
                    'INFJ': {
                        tid:10, cid : 3, id : 10
                    },
                    'ENFP': {
                        tid:11, cid : 3, id : 11
                    },
                    'INFP': {
                        tid:12, cid : 3, id : 12
                    },
                    'ENTJ': {
                        tid:13, cid : 4, id : 13
                    },
                    'INTJ': {
                        tid:14, cid : 4, id : 14
                    },
                    'ENTP': {
                        tid:15, cid : 4, id : 15
                    },
                    'INTP' : {
                        tid:16, cid : 4, id : 16
                    }

                 },

    city : [
                    {name: '北京', value: ['北京']},
                    {name: '重庆', value: ['重庆']},
                    {name: '上海', value: ['上海']},
                    {name: '天津', value: ['天津']},
                    {
                        name: '安徽',
                        value: ['合肥', '芜湖', '蚌埠', '淮南', '马鞍山', '淮北', '铜陵', '安庆', '黄山', '滁州', '阜阳', '宿州', '六安', '亳州', '池州', '宣城']
                    },
                    {
                        name: '澳门',
                        value: ['澳门半岛', '氹仔岛', '路环岛']
                    },
                    {
                        name: '福建',
                        value: ['福州', '厦门', '莆田', '三明', '泉州', '漳州', '南平', '龙岩', '宁德']
                    },
                    {
                        name: '广东',
                        value: ['广州', '韶关', '深圳', '珠海', '汕头', '佛山', '江门', '湛江', '茂名', '肇庆', '惠州', '梅州', '汕尾', '河源', '阳江', '清远', '东莞', '中山', '潮州', '揭阳', '云浮']
                    },
                    {
                        name: '广西',
                        value: ['南宁', '柳州', '桂林', '梧州', '北海', '防城港', '钦州', '贵港', '玉林', '百色', '贺州', '河池', '来宾', '崇左']
                    },
                    {
                        name: '甘肃',
                        value: ['兰州', '嘉峪关', '金昌', '白银', '天水', '武威', '张掖', '平凉', '酒泉', '庆阳', '定西', '陇南', '临夏', '甘南']
                    },
                    {
                        name: '贵州',
                        value: ['贵阳', '六盘水', '遵义', '安顺', '毕节', '铜仁', '黔西南', '黔东南', '黔南']
                    },
                    {
                        name: '河北',
                        value: ['石家庄', '唐山', '秦皇岛', '邯郸', '邢台', '保定', '张家口', '承德', '沧州', '廊坊', '衡水']
                    },
                    {
                        name: '河南',
                        value: ['郑州', '开封', '洛阳', '平顶山', '安阳', '鹤壁', '新乡', '焦作', '濮阳', '许昌', '漯河', '三门峡', '南阳', '商丘', '信阳', '周口', '驻马店']
                    },
                    {
                        name: '海南',
                        value: ['海口', '三亚', '三沙']
                    },
                    {
                        name: '湖北',
                        value: ['武汉', '黄石', '十堰', '宜昌', '襄阳', '鄂州', '荆门', '孝感', '荆州', '黄冈', '咸宁', '随州', '恩施']
                    },
                    {
                        name: '湖南',
                        value: ['长沙', '株洲', '湘潭', '衡阳', '邵阳', '岳阳', '常德', '张家界', '益阳', '郴州', '永州', '怀化', '娄底', '湘西']
                    },
                    {
                        name: '黑龙江',
                        value: ['哈尔滨', '齐齐哈尔', '鸡西', '鹤岗', '双鸭山', '大庆', '伊春', '佳木斯', '七台河', '牡丹江', '黑河', '绥化', '大兴安岭']
                    },
                    {
                        name: '吉林',
                        value: ['长春', '吉林', '四平', '辽源', '通化', '白山', '松原', '白城', '延边']
                    },
                    {
                        name: '江苏',
                        value: ['南京', '无锡', '徐州', '常州', '苏州', '南通', '连云港', '淮安', '盐城', '扬州', '镇江', '泰州', '宿迁']
                    },
                    {
                        name: '江西',
                        value: ['南昌', '景德镇', '萍乡', '九江', '新余', '鹰潭', '赣州', '吉安', '宜春', '抚州', '上饶']
                    },
                    {
                        name: '辽宁',
                        value: ['沈阳', '大连', '抚顺', '鞍山', '本溪', '丹东', '锦州', '营口', '阜新', '辽阳', '盘锦', '铁岭', '朝阳', '葫芦岛', '金普新区']
                    },
                    {
                        name: '内蒙古',
                        value: ['呼和浩特', '包头', '乌海', '赤峰', '通辽', '鄂尔多斯', '呼伦贝尔', '巴彦淖尔', '乌兰察布', '兴安盟', '锡林郭勒盟', '阿拉善盟']
                    },
                    {
                        name: '宁夏',
                        value: ['银川', '石嘴山', '吴忠', '固原', '中卫']
                    },
                    {
                        name: '青海',
                        value: ['西宁', '海东', '海北', '黄南', '海南', '果洛', '玉树', '海西']
                    },
                    {
                        name: '四川',
                        value: ['成都', '自贡', '攀枝花', '泸州', '德阳', '绵阳', '广元', '遂宁', '内江', '乐山', '南充', '眉山', '宜宾', '广安', '达州', '雅安', '巴中', '资阳', '阿坝', '甘孜', '凉山']
                    },
                    {
                        name: '山东',
                        value: ['济南', '青岛', '淄博', '枣庄', '东营', '烟台', '潍坊', '济宁', '泰安', '威海', '日照', '莱芜', '临沂', '德州', '聊城', '滨州', '菏泽']
                    },
                    {
                        name: '山西',
                        value: ['太原', '大同', '阳泉', '长治', '晋城', '朔州', '晋中', '运城', '忻州', '临汾', '吕梁']
                    },
                    {
                        name: '陕西',
                        value: ['宝鸡', '西安', '铜川', '咸阳', '渭南', '延安', '汉中', '榆林', '安康', '商洛', '西咸']
                    },
                    {
                        name: '台湾',
                        value: ['台北', '高雄', '基隆', '台中', '台南', '新北', '宜兰', '桃园', '新竹', '苗栗', '彰化', '南投', '云林', '嘉义', '屏东', '台东', '花莲', '澎湖', '金门', '连江']
                    },
                    {
                        name: '香港',
                        value: ['香港岛', '九龙', '新界']
                    },
                    {
                        name: '新疆',
                        value: ['乌鲁木齐', '克拉玛依', '吐鲁番', '哈密', '昌吉', '博尔塔拉', '巴音郭楞', '阿克苏', '克孜勒苏', '喀什', '和田', '伊犁', '塔城', '阿勒泰']
                    },
                    {
                        name: '西藏',
                        value: ['拉萨', '日喀则', '昌都', '山南', '那曲', '阿里', '林芝']
                    },
                    {
                        name: '云南',
                        value: ['昆明', '曲靖', '玉溪', '保山', '昭通', '丽江', '普洱', '临沧', '楚雄', '红河', '文山', '西双版纳', '大理', '德宏', '怒江', '迪庆']
                    },
                    {
                        name: '浙江',
                        value: ['杭州', '宁波', '温州', '嘉兴', '湖州', '绍兴', '金华', '衢州', '舟山', '台州', '丽水', '舟山新区']
                    }
                ],
    personType:{
        '大主管':'守护系',
        '管理者':'守护系',
        '组织者':'守护系',
        '保护者':'守护系',
        '女强人':'守护系',
        '监督者':'守护系',
        '奉献者':'守护系',
        '守护者':'守护系',

        '推进者':'艺术系',
        '实干家':'艺术系',
        '摄政官':'艺术系',
        '艺术家':'艺术系',
        '促进者':'艺术系',
        '巧思者':'艺术系',
        '外交家':'艺术系',

        '导师':'浪漫系',
        '理想者':'浪漫系',
        '哲学家':'浪漫系',
        '关怀者':'浪漫系',
        '教导主任':'浪漫系',
        '梦想家':'浪漫系',
        '启发者':'浪漫系',
        '治愈者':'浪漫系',

        '统帅者':'理智系',
        '思想者':'理智系',
        '创新者':'理智系',
        '分析师':'理智系',
        '领导者':'理智系',
        '睿智者':'理智系',
        '预言家':'理智系',
        '学者':'理智系',

    },
    personClass:{
        '守护系':'x-1',
        '艺术系':'x-2',
        '浪漫系':'x-3',
        '理智系':'x-4'
    }
};

// 不是小程序环境，页面URL暂时使用http访问
if (window.__wxjs_environment !== 'miniprogram') {
    Conf.domainRoot = Conf.domainRoot.replace('https://', 'http://');
}

module.exports = Conf;